cylinder/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	location    "system";
	object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../constant/parameters"

application     pisoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         $end_time;

deltaT          $delta_t;

//maxCo           0.5; // Or other Courant number you wish

adjustTimeStep  no; // yes or no 

//writeControl    adjustableRunTime;
writeControl    runTime;
//writeControl    timeStep;

writeInterval   0.25;
//timeInterval    1;
//writeFrequency  1;

purgeWrite      0;

writeFormat     binary; //or ascii

writePrecision  8;

timeFormat      general;

timePrecision   13;

runTimeModifiable true;

writeCompression  off;

functions
{
  #include "forceCoeffs"
}
// ************************************************************************* //
