cylinder/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       volScalarField;
	location    "0";
	object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../constant/parameters"

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0;

boundaryField
{
	walls
	{
		type zeroGradient;
	}
	
	inlet
	{
		type zeroGradient;
	}
	
	outlet
	{
		type  fixedValue;
		value	$internalField;
	}
	
	cylinder
	{
		type zeroGradient;
	}
	   
  frontAndBack
  {
  	type empty;
  }
}

// ************************************************************************* //
