cylinder/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       dictionary;
	location    "system";
	object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
	p
	{
		solver          PCG;
		preconditioner  DIC;
		tolerance       1e-06;
		relTol          0.05;
	}
	
	pFinal
	{
		solver          PCG;
		preconditioner  DIC;
		tolerance       1e-06;
		relTol          0;
	}
	
	U
	{
		solver          PBiCG;
		preconditioner  DILU;
		tolerance       1e-05;
		relTol          0;
	}
	//U
	//{
	//	solver    smoothSolver;
	//	smoother  symGaussSeidel;
	//	tolerance 1e-05;
	//	relTol    0;
	//}
	
	k
	{
		solver          PBiCG;
		preconditioner  DILU;
		tolerance       1e-05;
		relTol          0;
	}
	
	epsilon
	{
		solver          PBiCG;
		preconditioner  DILU;
		tolerance       1e-05;
		relTol          0;
	}
	
	R
	{
		solver          PBiCG;
		preconditioner  DILU;
		tolerance       1e-05;
		relTol          0;
	}
	
	nuTilda
	{
		solver          PBiCG;
		preconditioner  DILU;
		tolerance       1e-05;
		relTol          0;
	}
}

PISO
{
	nCorrectors 2;
	pRefCell    0;
	pRefValue   0;
	nNonOrthogonalCorrectors 1;
}


// ************************************************************************* //
